[
    {
        "Asset Type":  "Windows Server OS",
        "Asset Category":  "Device",
        "Asset Type Description": "The Windows Server OS is a robust, enterprise-level operating system developed by Microsoft. It is designed to handle data storage, application management, and communications at scale. Its widespread use in various environments, from retail to cloud platforms like Azure and GCP, makes it a common target for cyber threats. The OS has built-in security features, but its security posture can be influenced by factors such as configuration settings, patch management, and network architecture. Potential threat vectors include, but are not limited to, process manipulation, network eavesdropping, file system tampering, and hardware exploitation. The OS’s interaction with cloud environments also opens up potential attack vectors related to cloud resources.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "Medium",
                "Hardware": "High"
            },  
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Windows Client OS",
        "Asset Category":  "Device",
        "Asset Type Description": "The Windows Client OS is a widely used operating system developed by Microsoft, designed for end-user computing on personal computers, laptops, and workstations. It supports a broad range of applications and user activities, from document editing and web browsing to software development and multimedia playback. Given its widespread use, it is a common target for cyber threats. Security considerations include potential vulnerabilities in the OS itself, installed applications, and user behavior. Threat vectors can range from malware and ransomware attacks to phishing and social engineering tactics. The OS has built-in security features such as Windows Defender and BitLocker, but its security posture can be significantly influenced by factors like user privileges, network settings, and patch management.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Edge": {
                "Process": "Medium",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Linux Server OS",
        "Asset Category":  "Device",
        "Asset Type Description": "The Linux Server OS is a highly versatile and widely used operating system known for its robustness and reliability. It is commonly used in server environments across various sectors due to its high degree of customizability and strong open-source community support. Linux Server OS can be configured to serve a multitude of roles such as web servers, database servers, application servers, and many more. Given its widespread use, it is often a target for cyber threats. Security considerations include potential vulnerabilities in the OS itself, installed applications, and user behavior. Threat vectors can range from privilege escalation and kernel exploits to network intrusion and file system tampering. The OS has built-in security features such as SELinux and AppArmor, but its security posture can be significantly influenced by factors like user privileges, network settings, and patch management.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Mac Client OS",
        "Asset Category":  "Device",
        "Asset Type Description": "The Mac Client OS, officially known as macOS, is a proprietary operating system developed by Apple Inc. for its line of Macintosh computers. It is known for its sleek design, reliability, and seamless integration with other Apple products and services. macOS is commonly used in a variety of environments, including professional, educational, and personal settings. Despite its reputation for robust security, macOS is not immune to cyber threats. Security considerations include potential vulnerabilities in the OS itself, installed applications, and user behavior. Threat vectors can range from malware and ransomware attacks to phishing and social engineering tactics. The OS has built-in security features such as Gatekeeper, XProtect, and FileVault, but its security posture can be significantly influenced by factors like user privileges, network settings, and patch management.",
        "Monitoring Coverage": { 
            "Corporate": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "Medium",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Container",
        "Asset Category":  "Device",
        "Asset Type Description": "A Container is a lightweight, stand-alone, executable package that includes everything needed to run a piece of software, including the code, a runtime, libraries, environment variables, and config files. Containers are designed to provide a consistent and reproducible environment across various computing platforms. They are commonly used in microservices architectures and in DevOps practices for their scalability, portability, and efficiency. Despite their benefits, containers also present unique security challenges. These include potential vulnerabilities in the container images, the container runtime, the underlying host OS, and the orchestration platform. Threat vectors can range from breakout attacks, where an attacker gains access to the host system from within a container, to attacks on the container orchestration platform, such as Kubernetes.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Switch",
        "Asset Category":  "Device",
        "Asset Type Description": "A Network Switch is a networking device that connects multiple devices together on a computer network by using packet switching to receive, process, and forward data to the destination device. Network switches are a key component of many business networks, as they can connect multiple PCs, servers, or other hardware. Switches manage the flow of data across a network by transmitting a received network packet only to the one or more devices for which the packet is intended. Each networked device connected to a switch can be identified by its network address, allowing the switch to regulate the flow of traffic. This maximizes the security and efficiency of the network. Because they are points of intra-network traffic, switches can be configured to prioritize certain types of data over others. Despite their benefits, network switches also present security challenges. These include potential vulnerabilities in the switch firmware, the configuration settings, and the management of network traffic. Threat vectors can range from unauthorized access, denial of service attacks, to man-in-the-middle attacks.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            },  
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Router",
        "Asset Category":  "Device",
        "Asset Type Description": "A Router is a networking device that forwards data packets between computer networks. Routers perform the traffic directing functions on the internet; data sent through the internet, such as a web page or email, is in the form of data packets. A router is connected to two or more data lines from different networks. When a data packet comes in on one of the lines, the router reads the network address information in the packet header to determine the ultimate destination. Then, using information in its routing table or routing policy, it directs the packet to the next network on its journey. Routers have a critical role in the performance and security of a network. They are often targets of attacks due to their pivotal role in managing network traffic. Security considerations include potential vulnerabilities in the router firmware, configuration settings, and network traffic management. Threat vectors can range from unauthorized access, denial of service attacks, to man-in-the-middle attacks.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Azure": {
                "Process": "None",
                "Network": "Medium",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "None",
                "Network": "Medium",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            },  
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Firewall",
        "Asset Category":  "Device",
        "Asset Type Description": "A Firewall is a network security device that monitors and filters incoming and outgoing network traffic based on an organization’s previously established security policies. At its most basic, a firewall is essentially the barrier that sits between a private internal network and the public Internet. A firewall’s main purpose is to allow non-threatening traffic in and to keep dangerous traffic out. This is achieved by configuring set rules that allow or disallow specific traffic. Firewalls can be hardware or software-based. They are a first line of defense in network security and monitor and control traffic based on security levels of access. Security considerations include potential vulnerabilities in the firewall firmware, configuration settings, and rule definitions. Threat vectors can range from unauthorized access, denial of service attacks, to bypassing firewall rules.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            },  
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "File Share",
        "Asset Category":  "Device",
        "Asset Type Description": "A File Share is a system in a network that enables users or systems to store and exchange data. This data is often organized into a hierarchical structure of folders and files, and can be accessed concurrently by multiple users or systems. File shares can be found in various environments, from local networks to cloud-based storage services. They are crucial for collaboration and data management in many organizations. However, they also present security challenges. These include potential unauthorized access, data leakage, and malware propagation. Security considerations include the configuration of access controls, the sensitivity of the data stored, and the security of the network on which the file share is hosted. Threat vectors can range from exploiting weak permissions, intercepting data in transit, to uploading malicious files.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Performance Hub": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Printer",
        "Asset Category":  "Device",
        "Asset Type Description": "A Printer is a peripheral device that produces a hard copy of documents stored in electronic form, usually on physical print media such as paper or transparencies. Printers are a common component of many business and home networks. They can be connected to networks wirelessly or via physical cables, and can often store and process data. While printers are essential for various tasks, they also present security challenges. These include potential unauthorized access, data leakage, and the exploitation of firmware vulnerabilities. Security considerations include the configuration of access controls, the sensitivity of the data processed, and the security of the network to which the printer is connected. Threat vectors can range from intercepting print jobs, exploiting weak printer settings, to using the printer as an entry point to the network.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "OT Device",
        "Asset Category":  "Device",
        "Asset Type Description": "An Operational Technology (OT) Device refers to hardware and software that detects or causes changes through the direct monitoring and/or control of physical devices, processes, and events in the enterprise. This includes devices that are part of industrial control systems (ICS), such as SCADA systems, PLCs, and other types of industrial equipment. OT devices are commonly used in manufacturing, energy production, and other industrial settings. While these devices are critical for operational efficiency, they also present unique security challenges. These include potential vulnerabilities in the device firmware, communication protocols, and physical security. Threat vectors can range from unauthorized access, denial of service attacks, to man-in-the-middle attacks. Given that OT devices often control physical processes, a successful attack can have serious real-world consequences.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "IOT Device",
        "Asset Category":  "Device",
        "Asset Type Description": "An Internet of Things (IoT) Device refers to any physical device that is connected to the internet and capable of collecting and sharing data. IoT devices range from consumer products like smart home appliances and wearables to industrial sensors and actuators. These devices often communicate with each other and with cloud-based services, forming a complex network that can generate valuable insights and enable automation. However, they also present significant security challenges. These include potential vulnerabilities in the device firmware, communication protocols, and data privacy. Threat vectors can range from unauthorized access, denial of service attacks, to data leakage. Given the diversity and quantity of IoT devices, and the sensitivity of the data they handle, a successful attack can have serious consequences.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Performance Hub": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "SaaS Web Application",
        "Asset Category":  "Device",
        "Asset Type Description": "A SaaS Web Application (Software as a Service) is a software distribution model in which a third-party provider hosts applications and makes them available to customers over the Internet. Examples of SaaS applications include email and collaboration tools, customer relationship management software, and enterprise resource planning software. SaaS applications can be accessed from various devices anywhere in the world, which makes them highly flexible but also presents security challenges. These include potential vulnerabilities in the application code, user access controls, and data privacy. Threat vectors can range from unauthorized access, data leakage, to attacks on the application’s underlying infrastructure.",
        "Monitoring Coverage": { 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Virtual Machine",
        "Asset Category":  "Device",
        "Asset Type Description": "A Virtual Machine (VM) is a software emulation of a computer system. It runs on a host machine and provides the functionality of a physical computer. Its operation is based on the host machine’s hardware resources, which are distributed to the VMs as needed. VMs are widely used for various purposes, such as server consolidation, software development, and testing, and they form the backbone of cloud computing environments. Despite their benefits, VMs also present security challenges. These include potential vulnerabilities in the VM software (hypervisor), isolation between VMs, and management of virtualized resources. Threat vectors can range from unauthorized access, escape to the host machine, to attacks on the virtual network.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Database",
        "Asset Category":  "Device",
        "Asset Type Description": "A Database is an organized collection of data stored and accessed electronically. Databases are used to hold administrative information and more specialized data, such as engineering data or economic models. Examples include SQL databases like MySQL or PostgreSQL, NoSQL databases like MongoDB, and in-memory databases like Redis. They are crucial for a wide range of applications, from small desktop applications to large internet-facing applications, with many concurrent users. Despite their benefits, databases also present security challenges. These include potential unauthorized access, data leakage, and exploitation of software vulnerabilities. Security considerations include the configuration of access controls, the sensitivity of the data stored, and the security of the network on which the database is hosted. Threat vectors can range from SQL injection, privilege escalation, to data exfiltration.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Low",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Identity Provider",
        "Asset Category":  "Device",
        "Asset Type Description": "An Identity Provider (IdP) is a system entity that creates, maintains, and manages identity information for principals while providing authentication services to relying applications within a federation or distributed network. Identity providers offer user authentication as a service. Examples include services like Okta, Microsoft Active Directory, and Google Identity Platform. They are crucial for managing user access to multiple systems, enforcing authentication policies, and preventing unauthorized access. Despite their benefits, identity providers also present security challenges. These include potential unauthorized access, data leakage, and exploitation of software vulnerabilities. Security considerations include the configuration of access controls, the sensitivity of the identity data stored, and the security of the network on which the identity provider is hosted. Threat vectors can range from phishing attacks, session hijacking, to man-in-the-middle attacks.",
        "Monitoring Coverage": {
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Customer Identity",
        "Asset Category":  "User",
        "Asset Type Description": "A Customer Identity refers to the personal data and identity information of a customer that is stored and managed by an organization. This can include data such as names, email addresses, physical addresses, phone numbers, and more sensitive data like payment information or social security numbers. In the context of IT, customer identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for personalizing customer experiences, providing support, and conducting business transactions. However, they also present significant security challenges. These include potential unauthorized access, data leakage, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the customer identities are stored and processed. Threat vectors can range from phishing attacks, data breaches, to identity theft. ",
        "Monitoring Coverage": { 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Employee Identity",
        "Asset Category":  "User",
        "Asset Type Description": "An Employee Identity refers to the unique set of credentials and attributes assigned to an employee within an organization’s IT systems. This can include data such as usernames, email addresses, roles, and more sensitive data like passwords or biometric data. In the context of IT, employee identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for managing access to systems, tracking activity, and maintaining accountability. However, they also present significant security challenges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the employee identities are stored and processed. Threat vectors can range from phishing attacks, data breaches, to identity theft.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Contractor Identity",
        "Asset Category":  "User",
        "Asset Type Description": "A Contractor Identity refers to the unique set of credentials and attributes assigned to a contractor within an organization’s IT systems. This can include data such as usernames, email addresses, roles, and more sensitive data like passwords or biometric data. In the context of IT, contractor identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for managing access to systems, tracking activity, and maintaining accountability. However, they also present significant security challenges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the contractor identities are stored and processed. Threat vectors can range from phishing attacks, data breaches, to identity theft.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Vendor Identity",
        "Asset Category":  "User",
        "Asset Type Description": "A Vendor Identity refers to the unique set of credentials and attributes assigned to a vendor within an organization’s IT systems. This can include data such as usernames, email addresses, roles, and more sensitive data like passwords or biometric data. In the context of IT, vendor identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for managing access to systems, tracking activity, and maintaining accountability. However, they also present significant security challenges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the vendor identities are stored and processed. Threat vectors can range from phishing attacks, data breaches, to identity theft.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Device Identity",
        "Asset Category":  "User",
        "Asset Type Description": "A Device Identity refers to the unique set of attributes assigned to a device within an organization’s IT systems. This can include data such as device names, IP addresses, MAC addresses, and more sensitive data like device certificates or keys. In the context of IT, device identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for managing access to systems, tracking activity, and maintaining accountability. However, they also present significant security challenges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the device identities are stored and processed. Threat vectors can range from device spoofing, man-in-the-middle attacks, to data breaches.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Service Identity",
        "Asset Category":  "User",
        "Asset Type Description": "A Service Identity refers to the unique set of credentials and attributes assigned to a service within an organization’s IT systems. This can include data such as service names, IP addresses, and more sensitive data like service certificates or keys. In the context of IT, service identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for managing access to systems, tracking activity, and maintaining accountability. However, they also present significant security challenges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the service identities are stored and processed. Threat vectors can range from service spoofing, man-in-the-middle attacks, to data breaches.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Developer Identity",
        "Asset Category":  "User",
        "Asset Type Description": "A Developer Identity refers to the unique set of credentials and attributes assigned to a developer within an organization’s IT systems. This can include data such as usernames, email addresses, roles, and more sensitive data like SSH keys or personal access tokens. In the context of IT, developer identities are often managed through identity and access management systems, which control access to resources within an organization. These identities are crucial for managing access to code repositories, deployment systems, and other development tools. However, they also present significant security challenges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the developer identities are stored and processed. Threat vectors can range from code injection, privilege escalation, to data breaches.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Administrator Identity",
        "Asset Category":  "User",
        "Asset Type Description": "An Administrator Identity refers to the unique set of credentials and attributes assigned to an administrator within an organization’s IT systems. This can include data such as usernames, email addresses, roles, and more sensitive data like passwords or personal access tokens. In the context of IT, administrator identities often have elevated privileges that allow them to manage system configurations, install software, and manage user accounts. These identities are crucial for maintaining the IT systems within an organization. However, they also present significant security challenges due to their elevated privileges. These include potential unauthorized access, insider threats, and compliance with data protection regulations. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the administrator identities are stored and processed. Threat vectors can range from privilege escalation, account takeover, to data breaches.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Medium",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "High",
                "Cloud": "None",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "Low",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Mobile Device Android",
        "Asset Category":  "Device",
        "Asset Type Description": "An Android Mobile Device refers to a smartphone or tablet running the Android operating system. Android, developed by Google, is the world’s most widely used mobile operating system. These devices are equipped with a variety of features such as internet connectivity, GPS, cameras, and access to a vast array of applications through the Google Play Store. While these features provide rich functionality, they also present a broad surface for potential security threats. Security considerations include potential vulnerabilities in the Android OS itself, installed applications, and user behavior. Threat vectors can range from malware and ransomware attacks to phishing and social engineering tactics. The device’s security posture can be significantly influenced by factors like device settings, user privileges, and patch management.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Edge": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Mobile Device iOS",
        "Asset Category":  "Device",
        "Asset Type Description": "An iOS Mobile Device refers to a smartphone or tablet running the iOS operating system. iOS, developed by Apple Inc., is known for its user-friendly interface, seamless integration with other Apple products, and robust security features. These devices are equipped with a variety of features such as internet connectivity, GPS, cameras, and access to a vast array of applications through the Apple App Store. While these features provide rich functionality, they also present a broad surface for potential security threats. Security considerations include potential vulnerabilities in the iOS OS itself, installed applications, and user behavior. Threat vectors can range from malware and ransomware attacks to phishing and social engineering tactics. The device’s security posture can be significantly influenced by factors like device settings, user privileges, and patch management.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Edge": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Web Application",
        "Asset Category":  "Application",
        "Asset Type Description": "A Web Application is a software application that runs on a web server and is accessed via a web browser over a network, such as the internet or an intranet. Web applications can range from simple static web pages to complex, dynamic applications that interact with databases and other services. They are a crucial component of modern business infrastructure, enabling everything from e-commerce to data analysis to collaboration. However, they also present significant security challenges. These include potential vulnerabilities in the application code, user authentication mechanisms, and data handling practices. Threat vectors can range from injection attacks, cross-site scripting (XSS), to session hijacking. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the server on which the web application is hosted.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "GraphQL API",
        "Asset Category":  "Application",
        "Asset Type Description": "A GraphQL API is an application programming interface that uses GraphQL, a query language for APIs, to execute queries with existing data. GraphQL provides a more efficient and powerful alternative to REST and offers significant advantages for data-driven applications by allowing clients to request exactly what they need, making it possible to get many resources in a single request. However, GraphQL APIs also present unique security challenges. These include potential vulnerabilities in the GraphQL schema, query validation mechanisms, and data handling practices. Threat vectors can range from injection attacks, denial of service (DoS) attacks due to resource-intensive queries, to unauthorized data exposure. Security considerations include the configuration of access controls, rate limiting, query depth limiting, and the security of the server on which the GraphQL API is hosted.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Azure Cloud Service",
        "Asset Category":  "Device",
        "Asset Type Description": "An Azure Cloud Service refers to a service provided by Microsoft’s Azure platform, a comprehensive suite of cloud-based computing services. Azure services encompass a wide range of functionalities including computing power, storage options, data databases, analytics, networking, and artificial intelligence capabilities. These services are scalable, reliable, and offer a pay-as-you-go pricing model. However, they also present security challenges. These include potential misconfigurations, weak access controls, and vulnerabilities in the service itself or in user applications running on Azure. Threat vectors can range from unauthorized access, data leakage, to attacks on the underlying infrastructure. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the network on which the Azure services are accessed. Azure provides a variety of security features and compliance certifications, but the security posture of an Azure service largely depends on how it is used and configured.",
        "Monitoring Coverage": {
           "Azure": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "REST API",
        "Asset Category":  "Application",
        "Asset Type Description": "A REST API (Representational State Transfer Application Programming Interface) is a set of rules and conventions for building and interacting with web services. It uses standard HTTP methods like GET, POST, PUT, DELETE to perform operations on resources, which are represented in either XML or JSON format. REST APIs are stateless, meaning that each request from a client to a server must contain all the information needed to understand and process the request. While REST APIs offer a powerful and flexible way to interact with web services, they also present security challenges. These include potential vulnerabilities in the API code, user authentication mechanisms, and data handling practices. Threat vectors can range from injection attacks, man-in-the-middle attacks, to data exposure due to weak access controls. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the server on which the REST API is hosted.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Container Orchestration Platform",
        "Asset Category":  "Device",
        "Asset Type Description": "A Container Orchestration Platform is a system that automates the deployment, scaling, networking, and management of containerized applications. Examples include Kubernetes, Docker Swarm, and Apache Mesos. These platforms provide a framework for managing containers and services, which can be particularly useful in large, dynamic environments. However, they also present security challenges. These include potential misconfigurations, weak access controls, and vulnerabilities in the platform itself or in the containerized applications. Threat vectors can range from unauthorized access, privilege escalation, to attacks on the underlying infrastructure. Security considerations include the configuration of access controls, network policies, and the security of the host systems on which the orchestration platform is running.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Low",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            },  
            "Azure": {
                "Process": "Low",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Low",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Low",
                "Network": "Medium",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Google Cloud Service",
        "Asset Category":  "Device",
        "Asset Type Description": "A Google Cloud Service refers to any of the scalable and reliable services provided by Google Cloud Platform (GCP), a suite of cloud computing services. GCP offers services in various domains including computing, storage, data analytics, machine learning, networking, and many more. These services are designed to provide enterprises with significant advantages, including powerful data analytics and machine learning capabilities, cost savings, and speed of deployment. However, they also present security challenges. These include potential misconfigurations, weak access controls, and vulnerabilities in the service itself or in user applications running on GCP. Threat vectors can range from unauthorized access, data leakage, to attacks on the underlying infrastructure. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the network on which the Google Cloud Services are accessed. GCP provides a variety of security features and compliance certifications, but the security posture of a Google Cloud Service largely depends on how it is used and configured.",
        "Monitoring Coverage": {
            "GCP": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Oracle Cloud Service",
        "Asset Category":  "Device",
        "Asset Type Description": "An Oracle Cloud Service refers to any of the scalable and reliable services provided by Oracle Cloud, a comprehensive suite of cloud computing services. Oracle Cloud offers services in various domains including computing, storage, data analytics, machine learning, networking, and many more. These services are designed to provide enterprises with significant advantages, including powerful data analytics and machine learning capabilities, cost savings, and speed of deployment. However, they also present security challenges. These include potential misconfigurations, weak access controls, and vulnerabilities in the service itself or in user applications running on Oracle Cloud. Threat vectors can range from unauthorized access, data leakage, to attacks on the underlying infrastructure. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the network on which the Oracle Cloud Services are accessed. Oracle Cloud provides a variety of security features and compliance certifications, but the security posture of an Oracle Cloud Service largely depends on how it is used and configured.",
        "Monitoring Coverage": {
            "OCI": {
                "Process": "None",
                "Network": "Low",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Third-Party SaaS Service",
        "Asset Category":  "Device",
        "Asset Type Description": "A Third-party SaaS Service refers to any Software as a Service (SaaS) provided by a third-party vendor over the internet. These services can range from cloud-based email and collaboration tools to customer relationship management and financial systems. Third-party SaaS services offer significant benefits, including cost savings, scalability, and access to professional-grade applications. However, they also present security challenges. These include potential unauthorized access, data leakage, and vulnerabilities in the service itself or in user configurations. Threat vectors can range from account takeover, data breaches, to attacks on the underlying infrastructure. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the network on which the SaaS services are accessed. The SaaS provider may offer a variety of security features and compliance certifications, but the security posture of a third-party SaaS service largely depends on how it is used and configured.",
        "Monitoring Coverage": {
            "Third-Party": {
                "Process": "Medium",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "None",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Third-Party Program",
        "Asset Category":  "Device",
        "Asset Type Description": "A Third-party Software Program refers to any software application or system that is developed by a vendor other than the manufacturer of the device or the provider of the operating system. This can include a wide range of software, from productivity applications and games to utilities and drivers. Third-party software programs can provide valuable functionality, but they also introduce potential security risks. These include vulnerabilities in the software itself, the way it is configured, or the way it interacts with other systems. Threat vectors can range from exploiting software vulnerabilities, malware infections, to unauthorized data access. Security considerations include the trustworthiness of the vendor, the security practices in the software development process, and the regularity and method of software updates.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Azure": {
                "Process": "Low",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Low",
                "Network": "Medium",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            },  
            "Performance Hub": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Employee Workstation Hardware",
        "Asset Category":  "Device",
        "Asset Type Description": "An Employee Workstation Hardware refers to the physical computing devices used by employees to perform their job functions. This can include desktop computers, laptops, monitors, keyboards, mice, and other peripherals. These devices are typically connected to an organization’s network and have access to various resources, including internal systems, cloud services, and the internet. While these devices are essential for productivity, they also present significant security challenges. These include potential unauthorized access, hardware tampering, and data leakage through physical ports or wireless interfaces. Security considerations include the configuration of device settings, the physical security of the device, and the security of the network to which the device is connected. Threat vectors can range from malware infections, hardware keyloggers, to theft or loss of the device.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Medium"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Medium"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Medium"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Medium"
            }, 
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Medium"
            },
            "Edge": {
                "Process": "Medium",
                "Network": "None",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "Medium"
            }
        }
    },
    {
        "Asset Type":  "Contractor Workstation Hardware",
        "Asset Category":  "Device",
        "Asset Type Description": "A Contractor Workstation Hardware refers to the physical computing devices used by contractors to perform their tasks. This can include desktop computers, laptops, monitors, keyboards, mice, and other peripherals. These devices are typically connected to an organization’s network and have access to various resources, including internal systems, cloud services, and the internet. While these devices are essential for productivity, they also present significant security challenges. These include potential unauthorized access, hardware tampering, and data leakage through physical ports or wireless interfaces. Security considerations include the configuration of device settings, the physical security of the device, and the security of the network to which the device is connected. Threat vectors can range from malware infections, hardware keyloggers, to theft or loss of the device.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Performance Hub": {
                "Process": "None",
                "Network": "Low",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Edge": {
                "Process": "None",
                "Network": "None",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Server Hardware",
        "Asset Category":  "Device",
        "Asset Type Description": "A Server Hardware refers to the physical devices used to run server operating systems and applications. This can include rack servers, blade servers, mainframes, and other types of hardware designed for high-performance computing. Server hardware is typically housed in data centers and has access to high-speed network connections, large amounts of storage, and other resources. While these devices are essential for running large-scale IT systems, they also present significant security challenges. These include potential unauthorized access, hardware tampering, and data leakage through physical ports or wireless interfaces. Security considerations include the physical security of the device, the configuration of device settings, and the security of the network to which the server hardware is connected. Threat vectors can range from hardware exploits, firmware attacks, to theft or damage of the device.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Medium",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Corporate": {
                "Process": "Medium",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Manufacturing": {
                "Process": "Medium",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }, 
            "Distribution Center": {
                "Process": "Medium",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Performance Hub": {
                "Process": "Medium",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Network Appliance",
        "Asset Category":  "Device",
        "Asset Type Description": "A Network Appliance refers to a device that is designed to carry out a specific network function. This can include routers, firewalls, switches, load balancers, and other devices that manage network traffic. Network appliances are typically dedicated hardware devices, but they can also be implemented as software applications running on general-purpose servers. While these devices are essential for maintaining network performance and security, they also present significant security challenges. These include potential unauthorized access, firmware vulnerabilities, and misconfigurations. Security considerations include the physical security of the device, the configuration of device settings, and the security of the network to which the network appliance is connected. Threat vectors can range from exploiting device vulnerabilities, intercepting network traffic, to denial of service attacks.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Azure": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Restricted Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Restricted Data refers to any data that is subject to legal, regulatory, contractual, or business-imposed restrictions on its access, distribution, or use. This can include a wide range of data types, from personally identifiable information (PII) and protected health information (PHI) to trade secrets and intellectual property. Restricted data is often subject to strict security controls to prevent unauthorized access, disclosure, modification, or destruction. These controls can include encryption, access controls, audit logging, and secure disposal methods. However, restricted data also presents significant security challenges. These include potential unauthorized access, data leakage, and compliance with data protection regulations. Threat vectors can range from social engineering attacks, data breaches, to insider threats.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Confidential Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Confidential Data refers to information that has been determined to be private or sensitive and is not intended for unauthorized access, disclosure, distribution, or use. This can include a wide range of data types, from personally identifiable information (PII) and financial data to trade secrets and intellectual property. Confidential data is often subject to strict security controls to prevent unauthorized access, disclosure, modification, or destruction. These controls can include encryption, access controls, audit logging, and secure disposal methods. However, confidential data also presents significant security challenges. These include potential unauthorized access, data leakage, and compliance with data protection regulations. Threat vectors can range from social engineering attacks, data breaches, to insider threats.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Internal Only Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Internal Only Data refers to information that is intended solely for use within an organization and is not to be shared with external entities. This can include a wide range of data types, from strategic plans and financial reports to employee records and proprietary software code. Internal only data is often subject to strict security controls to prevent unauthorized access, disclosure, modification, or destruction. These controls can include encryption, access controls, audit logging, and secure disposal methods. However, internal only data also presents significant security challenges. These include potential unauthorized access, data leakage, and compliance with data protection regulations. Threat vectors can range from social engineering attacks, data breaches, to insider threats.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Public Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Public Data refers to information that is freely available to the public and can be shared without restrictions. This can include a wide range of data types, from government statistics and weather data to open-source software code and publicly available research papers. While public data does not typically require the same level of security controls as confidential or internal data, it still presents certain security considerations. These include the integrity of the data, the reliability of the source, and the potential for misuse if combined with other data. Threat vectors can range from data corruption, disinformation, to privacy invasion through data aggregation.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Mainframe",
        "Asset Category":  "Device",
        "Asset Type Description": "A Mainframe is a high-performance computer used for large-scale computing purposes that require greater availability and security than a smaller-scale machine can offer. Mainframes are particularly used by large organizations for critical applications, typically bulk data processing such as census, industry and consumer statistics, ERP, and financial transaction processing. While mainframes bring processing power and reliability, they also present security challenges. These include potential unauthorized access, system vulnerabilities, and data leakage. Security considerations include the configuration of system settings, user access controls, and the security of the network to which the mainframe is connected. Threat vectors can range from exploiting system vulnerabilities, unauthorized system access, to insider threats.",
        "Monitoring Coverage": {
            "Kyndryl": {
                "Process": "Low",
                "Network": "Low",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Retail Network",
        "Asset Category":  "Network",
        "Asset Type Description": "Network refers to a type of network setup that uses standards to physically and logically connect devices in a local area network (LAN). Ethernet networks are widely used due to their speed, reliability, and scalability. They can connect devices such as computers, printers, and switches, allowing them to communicate and share resources. While Ethernet networks are essential for modern connectivity, they also present security challenges. These include potential unauthorized access, data interception, and network vulnerabilities. Security considerations include the configuration of network settings, access controls, and the security of the devices connected to the network. Threat vectors can range from ARP spoofing, MAC flooding, to man-in-the-middle attacks.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Backstage Network",
        "Asset Category":  "Network",
        "Asset Type Description": "Network refers to a type of network setup that uses standards to physically and logically connect devices in a local area network (LAN). Ethernet networks are widely used due to their speed, reliability, and scalability. They can connect devices such as computers, printers, and switches, allowing them to communicate and share resources. While Ethernet networks are essential for modern connectivity, they also present security challenges. These include potential unauthorized access, data interception, and network vulnerabilities. Security considerations include the configuration of network settings, access controls, and the security of the devices connected to the network. Threat vectors can range from ARP spoofing, MAC flooding, to man-in-the-middle attacks.",
        "Monitoring Coverage": {
            "Corporate": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Intra-Cloud Network",
        "Asset Category":  "Network",
        "Asset Type Description": "Network refers to a type of network setup that uses standards to physically and logically connect devices in a local area network (LAN). Ethernet networks are widely used due to their speed, reliability, and scalability. They can connect devices such as computers, printers, and switches, allowing them to communicate and share resources. While Ethernet networks are essential for modern connectivity, they also present security challenges. These include potential unauthorized access, data interception, and network vulnerabilities. Security considerations include the configuration of network settings, access controls, and the security of the devices connected to the network. Threat vectors can range from ARP spoofing, MAC flooding, to man-in-the-middle attacks.",
        "Monitoring Coverage": {
            "Azure": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Inter-Cloud Network",
        "Asset Category":  "Network",
        "Asset Type Description": "An Inter-Cloud Network refers to a network that connects and allows interoperability between different cloud service providers. This can include connections between public clouds, private clouds, or a combination of both. Inter-cloud networking enables organizations to distribute their resources across multiple cloud environments, enhancing scalability, redundancy, and flexibility. However, it also presents significant security challenges. These include potential unauthorized access, data leakage, and vulnerabilities in the network configurations. Security considerations include the configuration of network settings, access controls, and the security of the network connections between the cloud service providers. Threat vectors can range from man-in-the-middle attacks, data breaches, to denial of service attacks.",
        "Monitoring Coverage": {
             "Azure": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            },
            "Performance Hub": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            },
            "Edge": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "DMZ Network",
        "Asset Category":  "Network",
        "Asset Type Description": "A DMZ Network (Demilitarized Zone Network) is a physical or logical subnetwork that contains and exposes an organization’s external-facing services to an untrusted network, usually the internet. The purpose of a DMZ is to add an additional layer of security to an organization’s local area network (LAN); an external attacker only has access to equipment in the DMZ, rather than the whole of the network. Common services that might be hosted in a DMZ include web servers, mail servers, and FTP servers. While a DMZ provides a robust layer of security, it also presents security challenges. These include potential unauthorized access, data leakage, and vulnerabilities in the network configurations. Security considerations include the configuration of network settings, access controls, and the security of the devices and services hosted in the DMZ. Threat vectors can range from exploiting service vulnerabilities, network breaches, to denial of service attacks.",
        "Monitoring Coverage": {
            "Azure": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "None",
                "File": "High",
                "Cloud": "High",
                "Hardware": "Low"
            }
        }
    },
    {
        "Asset Type":  "Cardholder Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Cardholder Data refers to any information contained on a customer’s payment card. This includes the cardholder’s name, the primary account number (PAN), and the card’s expiration date and service code. In the context of IT, cardholder data is often processed, stored, or transmitted in electronic commerce transactions. These data are crucial for processing payments but also present significant security challenges due to their sensitive nature. These include potential unauthorized access, data leakage, and compliance with data protection regulations such as the Payment Card Industry Data Security Standard (PCI DSS). Security considerations include the encryption of sensitive data, the configuration of access controls, and the security of the systems where the cardholder data are processed, stored, or transmitted. Threat vectors can range from phishing attacks, data breaches, to credit card fraud.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Electronic Protected Health Information",
        "Asset Category":  "Data",
        "Asset Type Description": "Electronic Protected Health Information (ePHI) refers to any individually identifiable health information that is held or transmitted by a covered entity or its business associate, in electronic form. This includes information that relates to the past, present, or future physical or mental health condition of an individual; the provision of health care to an individual; or the past, present, or future payment for the provision of health care to an individual. ePHI is often stored, processed, or transmitted in healthcare transactions. These data are crucial for providing healthcare services but also present significant security challenges due to their sensitive nature. These include potential unauthorized access, data leakage, and compliance with data protection regulations such as the Health Insurance Portability and Accountability Act (HIPAA). Security considerations include the encryption of sensitive data, the configuration of access controls, and the security of the systems where the ePHI is processed, stored, or transmitted. Threat vectors can range from phishing attacks, data breaches, to medical identity theft.", 
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Personally Identifiable Information",
        "Asset Category":  "Data",
        "Asset Type Description": "Personally Identifiable Information (PII) refers to any information that can be used to identify an individual. This can include, but is not limited to, name, social security number, date and place of birth, mother’s maiden name, or biometric records. In the context of IT, PII is often stored, processed, or transmitted in various business operations and transactions. These data are crucial for many business operations but also present significant security challenges due to their sensitive nature. These include potential unauthorized access, data leakage, and compliance with data protection regulations such as the General Data Protection Regulation (GDPR) or the California Consumer Privacy Act (CCPA). Security considerations include the encryption of sensitive data, the configuration of access controls, and the security of the systems where the PII is processed, stored, or transmitted. Threat vectors can range from phishing attacks, data breaches, to identity theft.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Personal Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Personal Data refers to any information relating to an identified or identifiable individual. This can include a wide range of data types, from basic information such as name and address, to more sensitive data such as biometric data, racial or ethnic origin, political opinions, religious beliefs, or health information. In the context of IT, personal data is often stored, processed, or transmitted in various business operations and transactions. These data are crucial for many business operations but also present significant security challenges due to their sensitive nature. These include potential unauthorized access, data leakage, and compliance with data protection regulations such as the General Data Protection Regulation (GDPR) or the California Consumer Privacy Act (CCPA). Security considerations include the encryption of sensitive data, the configuration of access controls, and the security of the systems where the personal data is processed, stored, or transmitted. Threat vectors can range from phishing attacks, data breaches, to identity theft.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Financial Reporting Data",
        "Asset Category":  "Data",
        "Asset Type Description": "Financial Reporting Data refers to the quantitative information generated by a company’s accounting system, which includes balance sheets, income statements, cash flow statements, and statements of shareholders’ equity. This data is crucial for understanding a company’s financial health and making informed business and investment decisions. However, due to its sensitive and confidential nature, it also presents significant security challenges. These include potential unauthorized access, data leakage, and compliance with financial regulations such as the Sarbanes-Oxley Act (SOX). Security considerations include the encryption of sensitive data, the configuration of access controls, and the security of the systems where the financial reporting data is processed, stored, or transmitted. Threat vectors can range from social engineering attacks, data breaches, to financial fraud.", 
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Email",
        "Asset Category":  "Data",
        "Asset Type Description": "Email Data refers to the information contained in an email system. This can include the content of emails, metadata such as sender and recipient information, date and time stamps, and attachments. Email data is often stored and managed in an email server and accessed through email clients. While email is a critical communication tool in many organizations, it also presents significant security challenges. These include potential unauthorized access, data leakage, and vulnerabilities in the email system or client software. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the network on which the email system is hosted. Threat vectors can range from phishing attacks, email spoofing, to malware delivered via email attachments.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Intellectual Property",
        "Asset Category":  "Data",
        "Asset Type Description": "Intellectual Property Data refers to information that represents legal rights to inventions, designs, and artistic works. This includes patents, trademarks, copyrights, trade secrets, and other proprietary information. In the context of IT, intellectual property data is often stored, processed, or transmitted in various business operations and transactions. These data are crucial for maintaining a company’s competitive advantage but also present significant security challenges due to their sensitive and valuable nature. These include potential unauthorized access, data leakage, and compliance with data protection regulations. Security considerations include the encryption of sensitive data, the configuration of access controls, and the security of the systems where the intellectual property data is processed, stored, or transmitted. Threat vectors can range from social engineering attacks, data breaches, to industrial espionage.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "OCI": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Kyndryl": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Third-Party": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Source Code",
        "Asset Category":  "Data",
        "Asset Type Description": "Source Code refers to the collection of computer instructions written in a human-readable programming language. This is the fundamental component of a software program that developers create and modify. Source code is often stored in repositories and version control systems like Git. While source code is essential for software development, it also presents significant security challenges. These include potential unauthorized access, code vulnerabilities, and leakage of sensitive information embedded in the code. Security considerations include the configuration of access controls, encryption of sensitive data, and the security of the systems where the source code is stored and processed. Threat vectors can range from exploiting code vulnerabilities, code injection attacks, to theft of proprietary algorithms or intellectual property.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "Low",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "USB Device",
        "Asset Category":  "Device",
        "Asset Type Description": "A USB Device refers to any device that uses Universal Serial Bus (USB) standards to connect to and interact with a computer or other electronic devices. USB devices can range from storage devices like flash drives, external hard drives, to input devices like keyboards and mice, and even complex devices like printers and scanners. While USB devices provide convenience and portability, they also present significant security challenges. These include potential unauthorized access, data leakage, and malware infections through ‘USB drops’ or ‘juice jacking’. Security considerations include the encryption of sensitive data stored on USB devices, the configuration of device controls, and the security of the systems to which the USB device is connected. Threat vectors can range from exploiting device vulnerabilities, data breaches, to hardware keyloggers disguised as regular USB devices.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },  
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "None",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    },
    {
        "Asset Type":  "Script",
        "Asset Category":  "Application",
        "Asset Type Description": "A Script refers to a set of instructions written in a scripting language like Python, Bash, or PowerShell that can be executed directly by an interpreter without needing to be compiled or installed. Scripts are often used for automating tasks, manipulating data, or interacting with system APIs. While scripts provide convenience and flexibility, they also present significant security challenges. These include potential unauthorized execution, script vulnerabilities, and leakage of sensitive information embedded in the script. Security considerations include the configuration of script execution controls, encryption of sensitive data within the script, and the security of the systems where the script is stored and executed. Threat vectors can range from code injection attacks, privilege escalation, to data breaches.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "Low",
                "Network": "None",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Macro-enabled Document",
        "Asset Category":  "Application, Data",
        "Asset Type Description": "A Macro-enabled Document refers to a file, typically a Microsoft Office document such as Word or Excel, that contains embedded scripts or ‘macros’. These macros can automate tasks, manipulate data, or interact with other software. While macros can provide significant productivity benefits, they also present significant security challenges. Macros can be used to perform almost any action that a user can perform manually in an application, which means they can also be used to carry out malicious activities if they are programmed to do so. These include potential unauthorized execution of commands, software vulnerabilities, and leakage of sensitive information. Security considerations include the configuration of macro execution controls, awareness of phishing attacks that encourage users to enable macros, and the security of the systems where the macro-enabled document is opened. Threat vectors can range from code injection attacks, privilege escalation, to data breaches.",
        "Monitoring Coverage": {
            "Retail": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "Low",
                "Network": "Low",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "Low",
                "Network": "None",
                "File": "Medium",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Office Document",
        "Asset Category":  "Data",
        "Asset Type Description": "An Office Document refers to a file created by a software application from the Microsoft Office Suite, such as Word, Excel, or PowerPoint. These documents can contain text, data, graphics, and other multimedia elements. While Office documents are essential for many business operations, they also present significant security challenges. These include potential unauthorized access, data leakage, and macro-enabled threats. Security considerations include the configuration of document access controls, encryption of sensitive data within the document, and the security of the systems where the office document is opened. Threat vectors can range from phishing attacks that encourage users to open malicious documents, to macro-based attacks that execute when a document is opened.", 
        "Monitoring Coverage": {
            "Retail": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Corporate": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Manufacturing": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Distribution Center": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            }, 
            "Azure": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            },
            "Edge": {
                "Process": "High",
                "Network": "High",
                "File": "Low",
                "Cloud": "High",
                "Hardware": "High"
            }
        }
    },
    {
        "Asset Type":  "Hypervisor",
        "Asset Category":  "Device",
        "Asset Type Description": "A Hypervisor, also known as a virtual machine monitor (VMM), is a type of software that creates and manages virtual machines (VMs) on a host system. Hypervisors provide a virtual operating platform that allows multiple operating systems to run on a host computer concurrently. There are two types of hypervisors: Type 1 (or native, bare metal) hypervisors run directly on the host’s hardware to control the hardware and to manage guest operating systems, examples include Microsoft Hyper-V and VMware ESXi. Type 2 (or hosted) hypervisors run on a conventional operating system just as other computer programs do. While hypervisors bring efficiency and flexibility, they also present security challenges. These include potential unauthorized access, system vulnerabilities, and isolation failure among different VMs. Security considerations include the configuration of hypervisor settings, user access controls, and the security of the host system on which the hypervisor is running. Threat vectors can range from exploiting hypervisor vulnerabilities, VM escape attacks, to unauthorized access to the VMs.", 
        "Monitoring Coverage": {
            "Retail": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Corporate": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            },
            "Manufacturing": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Distribution Center": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }, 
            "Azure": {
                "Process": "Low",
                "Network": "Low",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "GCP": {
                "Process": "Low",
                "Network": "Low",
                "File": "High",
                "Cloud": "Low",
                "Hardware": "High"
            }, 
            "Performance Hub": {
                "Process": "None",
                "Network": "Low",
                "File": "High",
                "Cloud": "High",
                "Hardware": "None"
            }
        }
    }
]